---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.VelocityPressure
source: html/6c6c03c5-0ec4-b2f2-87ae-00ce77e83400.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.VelocityPressure Property

The connector velocity pressure. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double VelocityPressure { get; }
```